<template>
    <div>
        <article-header title="花生PeAの个人资料" :description="getRandomItem(Fragment.concat(FragmentNormal))" />
        <profile-card :information="cardInfo">
            <radar-img
                    :radar-value="NormalRadarInfo"
                    radar-color="#B1C6AC,#85BD7D"
                    number-color="#1b2409"
                    border-color="#72A66A"
            ></radar-img>
        </profile-card>
        <block-collapsible lang="md" title="点击展开的指南" :folded="true">
            Yahello！这里是花生~~

            若你是第一次来到这里，可以阅读这个花生为你准备的炒鸡简单的阅读指南。

            这里是花生的个人资料页，也是电子简历存放的地方，制作这个站点的一个初衷就是：尽可能的去像大家展示更多，关于我。

            花生为了尽可能的表达清楚@-秀技术-@，所以在网站中使用了许多的“小花招”以增强阅读体验。

            比如说点击@@[这里](这里通常是关于点击词语的详细介绍，你可以再次点击页面的其他地方来隐藏这个窗口)@@可以显示更多信息。而有些文字又是不可见的，需要鼠标移入（PC端）或手指点击（移动端）才会显示@|（比如说这些文字）|@。是不是很有趣？

            为了方便快速的索引内容，有些模块是允许折叠的，比如说你现在正在阅读的这个“超级简单的指引”模块，在标题的右侧有一个<i class="fa fa-caret-down"></i>按钮，点击它，这个模块就会被折叠。当然，也有的模块是默认折叠的，你可以点击<i class="fa fa-caret-up"></i>按钮展开它~

            为了方便用户快速回到顶部，在页面的右下角增加了“回顶部”的按钮，你可以点击右下角的小兔子来快速回到顶部。

            值得一提的是，这里同时支持手机与电脑的访问，并且内容是完全相同的！
        </block-collapsible>
        <block-decal lang="md" img-src="/static/img/variety-kokoro.jpg">
            你可以切换左侧（PC端）或上方（移动端）的标签栏来查看不同的个人资料介绍风格，不同的风格侧重的信息会@-完全不一样-@有很大的不同。
        </block-decal>
        <block-collapsible lang="md" title="简单的自我介绍">
            你好！这里是花生PeA（pea3nut）！

            如你所见，这里是我自己制作的个人主页，因此我是一名@-死宅-@Web前端向的程序员。爱创造、爱动手、爱生活@-（love live）-@，差不多就是大众意义上的“积极向上的程序员”啦~~

            相传程序员群体死宅多。传言无从考证，但与传言相符的是：花生确确实实是一名死宅 —— 爱看动漫，热爱二次元，V家狂热粉。

            不过，和传统的@-死肥-@宅有所不同的是，花生是一个动手能力强的@-死肥-@宅。虽然热衷于买游戏，但是实际上真实玩游戏的时间其实并不是很多。我把这些时间投入到我喜爱的编程中，于是制作了一个又一个的@-大坑-@有趣的项目。比如这个，比如[那个](http://pxer.pea3nut.org)。

            爱看书、爱写文章。技术非技术的书籍都看，技术非技术的文章都写。混迹于各大社区与平台，但是现实生活中的交际却少之又少。@|你休想让我出去这个房间！除...除非......除非你请我喝咖啡！|@因此，在现实生活交际中，你会看到一个十分容易害羞的花生。

            所以，请主动的和花生搭话吧 :)
        </block-collapsible>
        <block-justify title="资料">
            <block-justify-row lang="md" title="性格">
                十分幽默，说是一名逗比也不足为过，@|经常因为突然想到什么好笑的事情而突然笑出声，然后吓倒旁边的人。。。|@会让自己和身边的人充满欢乐~

                由于童年某些@-惨痛-@不愉快的经历，性格有些敏感，比较容易沮丧，但是会很快振作起来。属于遇强则强的性格，抗打击能力与自制力超强。

                可以为别人的高兴而高兴，为别人的悲伤而悲伤。

                所以，你会看到花生从来不会有“嫉妒”这种情绪。花生会由衷的为对方而感到高兴。哪怕是自己不喜欢的人得到了什么花生很想要的东西，花生也只会去考虑自己如何得到，而不是去“酸葡萄”。

                极为接受现实。几乎从来不会抱怨、产生怨气，只会静静的接受一切，然后再次计算最优解，执行。
            </block-justify-row>
            <block-justify-row lang="md" title="网络&现实">
                实话实话，现实生活和网络时间中的花生完全是两个人。。。

                在网络世界中，你可以看到一个积极主动游刃有余的花生。各种主动搭话，表述东西有条有理，@-表情包繁多，-@灵活运用各种工具，知道各种官方渠道，简直就是“热情好客的本地人”。

                但是现实世界中却几乎截然相反：不会讲价、近乎瞎般的路痴、超级羞涩、常识匮乏、丢三落四。@|大学有次课间出来上厕所，然后就找不到上课的教室了。。。|@ @|大三的时候才学会如何吃火锅|@

                造成这个现象的一个很大的原因是：花生在网络世界里的活动要远远高于现实生活中。
            </block-justify-row>
            <block-justify-row lang="md" title="兴趣爱好">
                @-我只爱学习！！-@

                ACG爱好者，热爱Vocaloid音乐，因为Vocaloid而改变很多。

                对于数码硬件&软件有着莫名的兴趣，接触计算机比较早@|，为了能够在小时候使用计算机，有着“与家人斗智斗勇”的一段恢弘经历23333|@，对于计算机有着特别的感情，特别享受使用电脑的感觉。

                喜欢电子游戏，但是因为时间不是很多所以不常玩@|，因此更喜欢买游戏和安装游戏|@。同时在现实中也喜欢一些比较有趣的益智游戏，比如三国杀、天黑请闭眼、围棋等。自身是围棋3段。@|还拿过县级市比赛的围棋冠军哦~|@

                因为@-是个死宅-@不是一个@@[现充](#! md
                现充是指在现实生活中过的很充实的人。

                一般来说现充拥有很多朋友，可以经常和朋友组队出去玩，愉快的吃饭和约电影等等。

                没有一个明确的定义来解释需要充实到什么程度才能称为“现充”，大致的评判标准就是：“是否需要借助其他的东西让自己变得‘充实’起来”，比较典型的就是“玩游戏”、“看动漫”。
                )@@，所以喜欢看动漫，有着“较为严重的燃尽症”和“不轻的二禁症”，但能分清什么是现实@-，所以一般人其实看不出来花生是个死宅hhhh-@，因此十分擅长协调二次元和三次元之间的关系。

                特别喜欢用键盘写东西，不论是写代码还是写文章都很喜欢，认为听着音乐写些文章是一件非常非常惬意的事情@|所以经常做|@。
            </block-justify-row>
            <block-justify-row lang="md" title="自信满满">
                花生一直自信满满，尤其是在自己熟悉的领域中。

                特别喜欢竞争。喜欢争强好胜，喜欢第一名的喜悦，也不讨厌惨痛失败后的痛处。

                这些自信源于花生的@-聪慧-@计划性与自制力。

                花生做事非常有计划。常备一个月历，喜欢提前将各种事情安排好，然后有条不紊的按日程推进。哪怕计划因为某些因素而打乱，也会快速的重新规划出另一条最优解来作为新计划。

                并且，强大的自制力为计划执行提供了有效交付。

                花生可是那种说做到就可以做到的人哦~~
            </block-justify-row>
            <block-justify-row lang="md" title="独行">
                独行者，常一个人去看电影、一个人去吃烧烤、一个人去海边骑自行车、一个人去喝咖啡、一个人在夜晚散步。

                十分独立@|，荒野求生技能MAX|@。尽管社交技能薄弱，但是独立生存技能却十分熟练~~属于那种一个出去旅行完全没有问题的。常随身携带很多很多东西，比如创可贴、各类药品、应急食品、水、小刀、火机、蚊香@|，以前还随身携带75%医用酒精|@，保证在独行过程的顺利。

                不喜欢跟风，喜欢坚持自己认为正确的事情。正因为如此不合群，所以遭受过很多不愉快的事情，对所谓的“集体”、“大家”有一定的排斥心理。

                还好，独行的行为给予了花生极高的自由。因此可以常常一个人做一些奇怪的举动：有可能是在咖啡厅做一天，有可能是骑自行车去海边，也有可能爬上楼顶吹吹风

                生活方面十分容易得到满足。每当坐在海边吹着海风望着远方的时候，觉得其实如果可以一辈子坐在这里就已经足够了。
            </block-justify-row>
            <block-justify-row lang="md" title="经历">
                经历过很多。小升初试卷作废、初中辍学、高中学习倒二。。。不过由于这些过于不堪回首，还是从大学开始说好了。

                1. 在高考前，决定去实现最初的梦想
                1. 高考完毕后，开始自学Web开发技术，暑假四个月期间保持每天12+小时
                1. 入学后，发现学校没有Web开发相关组织。因此，自己创建了一个 —— “Web开发协会”
                1. 开始创业。注册公司，创业团队达到十几人、协会百余人，成员包涵3所高校
                1. 猛然意识到不应该再继续下去了。
                1. 注销公司、交接项目、协会会长换届。那时花生大三。
                1. 独自一人来到北京，继续完成大学里未实现的梦想...

                一笔带过的事件背后其实发生了很多很多的事情。有欢笑，但更多的是泪水，是惨痛的教训。

                曾经的座右铭是“相信，就会存在”，而现在则是“做好现在”。
            </block-justify-row>
        </block-justify>
        
    </div>
</template>

<script>
export default {
    extends :require('@/components/abstract/page.vue'),
    name :'page-normal',
    computed :{
        cardInfo(){
            return [{
                label:'姓名',
                text:'花生PeA',
            },{
                label:'常用ID',
                text:'pea3nut、PeA_nut、花生花生花、一滴水滴p',
            },{
                label:'性别',
                text:'男 <i class="fa fa-mars" style="color:#5b75ff;font-weight: bold;"></i>',
            },{
                label:'年龄',
                text:this.getPeA3nutAge(),
            },{
                label:'生日',
                text:'1995-5-18',
            },{
                label:'学校',
                text:'青岛理工大学',
            },{
                label:'现居地',
                text:this.Info['present_address'],
            },{
                label:'ＱＱ',
                text:'626954412',
            },{
                label:'职业',
                text:'程序员',
            },{
                label:'现状态',
                text:this.Info['now_state'],
            }]
        },
    },
    data(){return{
    }},
};
</script>