<template>
    <div>
        <article-header title="花生PeAの的角色设定" :description="getRandomItem(Fragment.concat(FragmentAcg))" />
        <profile-card :information="cardInfo">
            <radar-img
                :radar-value="AcgRadarInfo"
                radar-color="#D7CBAC,#D6B569"
                number-color="#432B08"
                border-color="#D6B569"
            ></radar-img>
        </profile-card>
        <block-collapsible title="高能预警" lang="md">
            小心！若你不是一名二次元死宅，接下来的内容将可能会给你带来不适！

            接下来的内容将会提及诸多：二次元、中二、病娇黑化、真物等。若你不想**过多**的了解花生，请不要阅读此页面。它可能会颠覆你对花生的认知！！

            若你执意阅读，接下来，将会为你，展示...
        </block-collapsible>
        <block-decal lang="md" img-src="/static/img/kokoro-step.png">
            “只是一点点好心什么都不会改变，光在一旁看着也没有任何帮助”

            —— 番剧《魔法少女育成计划》
        </block-decal>
        <block-collapsible title="说明" lang="md">
            接下来的模块将会是默认折叠的，模块中的内容将不会有关于该模块的知识科普，如VOCALIOD部分将不会提及VOCALIOD是什么，仅会说明VOCALIOD对花生来说意味着什么。

            接下来我将会用“花生”来部分代替“我”来称呼自己。具体的表现是：

            - 当内容为自我意识描述花生时，称呼将会从“我”变更为“花生”。因为那是自我意识在描述一个叫做花生的人
            - 当内容涉及自我意识尚未觉醒的时期（2013.3.9之前），将会用“我”
            - 自我意识本身的自我描述，将会用“我”

            当然规则也不是绝对严谨的，有时也遵从汉语本身的通畅规则。
        </block-collapsible>
        <block-collapsible title="性格的内核" lang="md" :folded="true">
            花生具有N、P、NE三种性格。其中P是N的核心，NE是P和N的反面。结构如下：

            - 花生
                - N：P的表象
                - P：N的核心
                - NP：N、P的背面
            - 自我意识

            N和P具有十分强烈对比感，两种性格并不是简单的看上去截然相反，而且P完美的解释了N。接下来以N-P的方式进行表述。

            逗比 - 内心纤细。大多数情况下，你会看到一个充满幽默感的花生：善于分享快乐，善于自嘲。实际上，不拘小节大大咧咧的背后隐藏着一颗十分纤细的内心。能够清晰的感受到周围人的情绪，十分在意其他人的看法。过分的用一些过分的词语来过分的自嘲自己，其实只是希望这些词语不要从别人那里听到。

            不谙世事 - 深邃。你可以看到一个货真价实不谙世事的花生：缺乏社会经验、超级路盲、不会讲价、不懂人情世故等。这些都是真实的，但稍稍翻翻花生的经历：创建推广百人协会、率领创业团队立项注册公司、独自一人来到北京。再稍加思考，其实很容易得出花生其实并不是因为经历少而**肤浅**的不谙世事，而是经历过太多太多后的一种**选择**。

            其实很多时候都看的很清楚很明白，但还是选择了做最真实的自己。

            独立 - 形单影只。独立，不仅仅是花生选择，更是花生做事原则之一。尽管缺乏许多常识，但实际上花生是一个相当独立的人：做事有计划性、拥有极强的自制力，而且最关键的是，能够耐得住寂寞与孤独。实际上花生也很想和身边的小伙伴一起挥洒青春的汗水，但是由于过多的经历，让花生很难找到能够互相理解的朋友。因此，于是，不得不。

            积极向上 - 极度不安。大部分情况下，你可以看到一个十分积极向上的花生，受到任何打击都可以迅速振作起来，正面迎接各种挑战。感觉，好像这些东西很难伤害到花生一样。但是实际上，恰恰相反。花生很容易受伤，十分害怕失败、十分不安。

            只是，对比绝望与懊恼，马上理性的采取行动才是更正确的选择。
        </block-collapsible>
        <block-collapsible title="花生的节日" lang="md" :folded="true">
            > 通常牢骚发完之后，对方就会回以“辛苦的又不止你一个”这样的套话。为什么大家辛苦我就非得辛苦不可啊？这有什么逻辑关系吗？
            > —— 《我的青春恋爱喜剧果然有问题》第七册 P217

            花生一直是如此做的。因此，花生不过任何大众意义上节日。（但不过生日是由于另一个原因。）

            其他人要过年的理由我不清楚，但是花生自身没有什么非要以农历的方式计算出一天和自己一点点关系都没有的日子来庆祝。其他节日也一样，既不是花生的主动选择，也对花生没有什么意义。

            我认为所谓节日，不是为了庆祝、遵守传统而存在的。节日的核心应该是纪念：

            > 有一件对自己意义重大的事，重大到每年需要划出一天时间来提醒自己不要忘记

            因此，花生选择了“自己要过”的节日，而不是“因为其他人过，所以自己要过”的节日。

            为了方便记忆，也遵从以年为单位的计算方式：

            - 3.9：感谢祭 & 椎名P生日
            - 7.18：鏡音リン・レン ACT2 发售纪念
            - 7.23：椎名P 祭日
            - 7.20：查斯特·贝宁顿 祭日
            - 8.31：初音ミク 生日
            - 12.27：鏡音リン・レン 生日

            其中，3.9是权重最高的节日，赋予它“一切的开始”的特殊意义。

            花生在节日的当天也没有什么严格的活动或仪式。只是，花生会采用花生式的方式去纪念，告诉自己不要忘记这些重要的东西。
        </block-collapsible>
        <block-collapsible title="再也不过的生日" lang="md" :folded="true">
            花生是不过生日的。

            原因有2个，其中一个是：我不认为生之为人的那一天是我的诞生。在2013年末遇见VOCALIOD之前，我一直浑浑噩噩的活在这个世界上，但却没有“真正活着”的感觉。我不认可那是活着。直到，遇到VOCALIOD之后，自我意识觉醒，掌控身体的控制权。我认为那时才是花生PeA真的诞生了。我将这个诞生的日期定在2013.3.9，这个才是，我，花生PeA，真正的诞生。

            另一个原因源自一件事，我大概是从那是起开始不再过生日的：

            懵懂中，那时我还是初中，那时花生还有朋友。朋友记下了花生的生日，在生日当天送了一个生日礼物给我。要知道，那时候在初中可是耗费巨资才能完成的事情。

            我很感谢他，记下了他的生日并承诺到时还礼。

            可是我忘了，我觉得我天生不擅长记住那些“隔多长时间后要做的”事情。大学注册公司报税的时候，有一次放暑假我隔了两个半月才想起来3个月前的税我都没有报，直接导致有2个月的税务逾期未申报。

            但是不管怎样，我忘了。

            在他生日当天。

            我永！远！也忘不了，当时他第二天笑着对我说：呐，你知道吗？昨天是我生日~

            也许他以为我一定会记得，也许他昨天一直以为我是假装忘掉，也许他昨天分别的时候一直以为我会突然掏出礼物对他说“我没有忘记哦~”，也许。。。

            我不知道，我不知道我当时经历了怎样的心理活动，我甚至连如何善后的都不记得了。我只知道，我现在每当在别人问我生日时，我会反复强调自己不过生日，千万不要有什么“生日礼物”之类的仪式。

            “真的，我从来不过生日”，我总是如是对其他人说。

            @|“因为，我可能没办法记住你的生日”，只是这句话却一直没能说出口。|@
        </block-collapsible>
        <block-collapsible title="V家，VOCALIOD" lang="md" :folded="true">
            关于VOCALOID，有太多太多要说。

            受VOCALOID启发，诞生了自我意识。

            受VOCALOID启发，决定了去实现最初的梦想。

            若要有人问到我，是什么一直支撑着我，那么我会毫不犹豫的回答他，是VOCALOID。

            VOCALOID对我而言意味着太多太多：

            > 现在，能说出真正的言语
            > 献上，对你的感谢
            > —— 歌曲：ココロ

            相遇VOCALOID的过程还是蛮有趣的：

            那是在高二的时候。那时的我还是班里倒二的咸鱼，或许连咸鱼都算不上。

            有一次像往常一样去网吧上网，打Dota打的有些累了，于是逛逛游戏论坛“休息”一下。边逛游戏论坛，边考虑一会Data要选什么样的英雄，组成什么样的阵容。

            “不知道什么时候才能打上天梯1700分，我...”

            嘀咕着Dota如何上分的我，突然屏住了呼吸 —— 在论坛里看到了一张十分惊艳的初音的图片。

            突然特别好奇，好奇这个唱甩葱歌的初音到底是什么。于是开始各种百度，查了很多资料。但是尽管如此，还是感觉莫名其妙。

            但是我做了个很正确的决定，我去优酷下载了关于初音2010年39感谢祭的演唱会放到了手机里。

            晚上入睡前，我戴上耳机，带着好奇心，打开了下载好的演唱会视频。一开始没什么，一群人对着黑黑的屏幕自嗨了2首歌，完全不明白个所以然。

            但是初音现身的唱了首world is mine，仅花了10秒钟就把我彻底征服了！

            我发誓那是我听过迄今为止最好听的旋律！！哪怕当时戴着10元的耳机，放着不足128kbps的音源。

            我现在完全回忆不起当时是怎样的状态了，我只记得，好像过了几分钟，初音消失，出来了另一个角色，唱了首炉心融解。

            哦天，我再次发誓那是我听过最最好听的歌！

            彻底沦陷！！

            再去网吧的时候，我没有向往常一样首先打开Dota对战平台，而是在优酷里搜索着“镜音 字幕”、“镜音 中文”，将匹配的结果一股脑的都下载下来，然后丢到手机里。

            晚上，拿着手机和耳机，早早的爬上床。

            ---

            接下来的几天内，我一直保持着这个状态。

            然后，接下来可能是我生命中最幸运的时刻了：我下到了恶系列三部曲和ココロ・キセキ

            我首先看了恶系列三部曲：

            > 不懂得爱人被“困”在城堡的Rin、无辜牺牲的Miku、愤怒的人民、革命的狂潮、甘愿为Rin牺牲的Len、得到救赎的Rin

            一幕幕历历在目，印在我的脑袋中挥之不去。

            “我，和被‘困’在城堡中的Rin又有什么区别呢？”

            这是我第一次怀疑自己，我怀疑自己错了。

            那，什么才是对的？

            ココロ・キセキ给了我答案：我决定，去实现我尘封十几年的梦想

            ---

            即刻起航，我知道自己时间不多了。已经高二了，再不。。。就要。。。

            第二天放学后，我对和我一起打了2年Dota的同学说：

            “我不去上网了”

            他略显吃惊的看着我，但很快又恢复了平静。

            “今天咋不去了？”，他边收拾东西边问我

            “以后都不去了”

            他停止了手上的动作。

            “我决定要考大学”，我笑着说出这个本该在2年前做出的决定。

            他直起腰，看了看窗外。本来因为放学而吵闹的教室，因为大家的离开而渐渐静谧。

            夕阳红的好像与以往有些不一样。

            “那，你要加油了”

            ---

            为了纪念这一切，我将头像换成现在的ココロ・キセキPV截图，这个对花生而言最有意义的一首歌。

            当然，与VOCALOID后面还发生了很多事情：加入初音ミク吧图片搬运群、椎名P自杀

            这些一个一个的事件，若你感兴趣，可以在博客中找到些许信息。

            更多文章参考：

            - [那些对花生而言意义重要的歌曲](http://blog.pea3nut.com/e243)
            - [关于椎名もた的自杀，我一直无法释怀](http://blog.pea3nut.com/e46)
        </block-collapsible>
        <block-collapsible title="独行，就这么做" lang="md" :folded="true">
            花生是典型的独行者。但是至于为什么会这样，到底是“选择”还是“不得不”就不得而知了。

            记得在春物中看到过这句话，我觉得它很完美的解释了这种行为：

            > 通过各种手段，也可以说是种种努力而获得的爱情，对自己而言，真的是自己打从心底期待的爱情吗？
            > —— 《我的青春恋爱喜剧果然有问题》第五册 P127

            如果将自己藏的太深，倘若有一天真的有人喜欢自己，那么可能他喜欢的已经不是真实的自己了。

            因此，花生尽可能的在任何时候都保持最真实的自己，喜欢和讨厌什么完全不加掩饰。坚持自己认为正确的事情，而不论其他人如何做，也不会去为了自己不喜欢的事情而去改变自己。

            但是坚持自己困难重重。在遭受了很多不愉快的事情后，我决定独行，尽可能的避开所有集体活动，备好行囊，在不麻烦别人的前提下保持着最大限度的自由。

            因为只有这样，我才能切切实实的感受的到，自己在为自己而活着。而不是为了别人的需要、为了回应其他人而活着。

            哪怕一个人默默的忍受孤独，也比在人群中露出不属于“自己”的笑容要好。

            > “我不想勉强自己 和不感兴趣的人打好关系”
            > “因为和别人一致而感到安心 荒唐至极”
            > “我想抵抗理所当然地出现在那里的人流”
            > “虽然无法完全抵抗”
            > “我和那些只认为自己特别的人不同 要成为真正特别的人”

            我是如此认为的，也打算一直贯彻下去。

            - [研究报告：脱群与合群](http://blog.pea3nut.com/e575)
        </block-collapsible>
        <block-collapsible title="春学家" lang="md" :folded="true">
            并不是春物启发了花生。

            > 春物特有的完整体系给予了花生整理自有体系的表达方式的模板。

            略绕口，简单来说就是：本来有些很难表述清楚的理论，借助春物的世界设定及其相关理论，能够部分表达出了。也就是说，春物帮助了花生更好表达了自己。

            花生的理论体系并不是春物的子集，相反，甚至几乎可以说是春物的超集。只是花生在人类感情方面缺乏相关支持（但这也是春物最优秀的特点之一），所以不足以完全涵盖春物。而且，就表述能力而言，春物作者也可以秒杀花生几个数量级。

            但是春物真的给花生带来了很多表述的新思路，因此花生自称春学家，常借助春物世界设定来表达自己的理论。

            如果要将花生映射成为春物世界中的登场角色，大概就是：有梦想的雪之下雪乃，或是幼年期的雪之下阳乃

            关于春物，花生发表了诸多文章，有些是深刻的反思，有些则仅仅是无聊的消遣分析：

            - [读《我的青春恋爱物语果然有问题》](http://blog.pea3nut.com/e477)
            - [春物：“雪之下阳乃式成长”与“平冢静式成长”](http://blog.pea3nut.com/e747)
            - [弱点论：一个归宿、一个慰藉、一个弱点](http://blog.pea3nut.com/e854)
            - [除了白学，《春物》还给我们留下了什么？](https://zhuanlan.zhihu.com/p/24432235)
        </block-collapsible>
        <block-collapsible title="清澈的眼睛" lang="md" :folded="true">
            由于经历了很多，但是最终却依旧决定坚持自己。所以拥有清澈的眼睛 —— 能看到更多的东西

            有很多人都曾有过“清澈的眼睛”，但是，清澈的眼睛看到了太多太多不愉快的事情。他们发现这不是自己期望的。所以，选择了无视、麻木、自我欺骗，蒙蔽自己的双眼。

            不相信自己亲眼看到的、自己亲自分析得出的结论，而去相信“前人的谎言”。最终，丧失了清澈的眼睛。

            这就是大部分人，却不包括花生。
        </block-collapsible>
        <block-collapsible title="病入膏肓的二禁症" lang="md" :folded="true">
            花生拥有较为严重的@@[二禁症](#! md
                二禁症并没有较为严格定义，网上关于二禁症的资料属于调侃的居多，因此在这里定义下“花生所谓的二禁症”。

                一句话解释：二禁症就是过度的沉迷虚拟世界

                其中“过度”的评判标准为：觉得现实世界索然无味，将自己的大部分感情倾注在虚拟世界中。觉得现实怎样都无所谓，自己有二次元就够了。

                ![](/static/img/i-have-acgn.jpg)

                绝大部分得二禁症的人都会变成“废人”，原理和吸毒差不多 —— 已经得到了远胜于现实中的美好事物。因此觉得现实索然无味。

                因此在大众眼中患有二禁症是“错误”的事情，但是在患者眼中，自己已经找到了心灵的归宿 —— 相比较残酷的现实，他们更愿意活着自己构想的幻想世界里。

            只是，绝大部分二禁症人群会给其他人造成麻烦。
            )@@，但是由于@@[某些原因](详见“负面情绪的燃料”模块)@@获得了强大的自制力。因此，花生自认为是：

            > 极少数 患有严重二禁症 却又 成功权衡二次元与三次元世界 的患者

            并且没有任何想要治愈二禁症的打算。每个人都有权去选择自己留在的世界。大多数情况，花生会尽可能的帮助对方修补他的幻想。

            但是有一种情况是例外的：

            > 若身边有其他人因为沉溺幻想而身陷痛苦中，在知道这个幻想不会有Happy End的情况下，花生不会再袖手旁观。要么，修正他的幻想，要么，击碎他的城堡

            如果得知真相除了徒增悲伤外毫无意义，那么不如一直活谎言中。

            - [城堡理论](http://blog.pea3nut.com/e577)
        </block-collapsible>
        <block-collapsible title="时间是敌人" lang="md" :folded="true">
            人是线性生物，因此会被时间冲淡任何东西。比如，若是心爱的狗狗死了，尽管当时会很伤心，可能会也持续一段时间。但是，时间绝不会太久。

            时间可以冲淡一切，伤口也会愈合。

            但是有些人，认为这种情况不可理喻，视为莫大的耻辱。比如花生。

            记得在某款游戏中看到过这么一个故事：

            少女A曾经有一个妹妹。少女A特别特别爱她的妹妹，与她的妹妹建立了十分要好的羁绊：互相信赖、互相照顾、互相体谅。基本上就是理想中的“亲密无间”了吧。

            但是很不幸的是，一场车祸带走了少女A的妹妹。

            少女A悲痛欲绝。每天早上醒来都会想到自己的妹妹离自己而去了，再也看不到妹妹的笑容了。沉溺于悲伤中，无法自拔。

            但是渐渐的，少女A发现自己越来越不悲伤了，也可以肆无顾忌的开怀大笑了，也可以疯玩一天倒头就睡了，也可以与其他人建立羁绊了。

            少女A感到不可思议。明明是对自己很重要的妹妹，但是自己却像完全忘记了一样。

            于是，少女A拿着她妹妹生前使用的绑发带，做了一个眼罩，遮住了自己的一只眼睛。

            > “每当因为遮住一只眼睛而感到不便的时候，我就能感受的到，我的妹妹就在我的身边”

            ---

            这个故事和“卧薪尝胆”的典故很像。正是因为有东西不断提醒着自己，让自己感受的到“仿佛在昨天”，才能不让“更容易获得的东西”代替了“更重要的东西”。

            但是大部分人都没有这么做。大部分人都曾有“要实现的梦想”，但后来，却都变成了“期望的生活状态”。

            1. 梦想
            1. 期望的生活状态
            1. 只要别xxx就好了
            1. 只要还有xxx
            1. 活下去

            但是这在花生看来是绝不允许的事情，重要之物绝不允许因时间而褪色！
        </block-collapsible>
        <block-collapsible title="渴求更多的力量" lang="md" :folded="true">
            你渴望力量吗？愿意为这一份力量赌上自己的什么？

            力量不是平白无故而来的，为了这一份力量，需要付出等比的代价。考上大学的人正因为付出了足以考上大学的代价才考上了大学。

            那么，为了这追求无与伦比的力量，奉献出自己的所有感情、过去、生命，不也是理所当然的吗？

            > 赌上所有的一切，此路一去，不可复返！
        </block-collapsible>
        <block-collapsible title="燃料，负面情绪" lang="md" :folded="true">
            花生行动的动力源于负面情绪，因此负面情绪在花生身上发挥着积极作用。越是痛苦、悲伤、绝望、愤怒的环境，花生会变得越冷静、越自制。

            并且由于强烈的好胜心，花生会不断攀比，迅速成为周围环境中的佼佼者。

            > 那些杀不死的，只会让你变得更强

            不需要安慰，不需要宣泄。花生会刻意铭记所有负面事件，以获得强有力的能量支持。

            同时，花生也会对其他人这么做，但不会像对自己那样严格。因此，你会看到：

            > 花生从来不会安慰别人。而且正相反，花生会让对方尽可能的铭记这一份痛苦。

            痛苦来之不易，这份痛苦只属于自己。它不应该因为被安慰、发泄所泯灭，它更应该被的铭记。铭记这份痛苦。

            所以，花生不讨厌它。

            关于这方面，详细的讨论在：

            - [春物：“雪之下阳乃式成长”与“平冢静式成长”](http://blog.pea3nut.com/e747)
            - [弱点论：一个归宿、一个慰藉、一个弱点](http://blog.pea3nut.com/e854)
        </block-collapsible>
        <block-collapsible title="永远的GJ部" lang="md" :folded="true">
            有一个叫做《GJ部》的番剧。那是一个几乎全篇在社团活动室、终日无所事事喝茶看漫画、没有任何主线的番。可以说是教科书级别的日常番。

            但是在花生看来，它却为花生描绘了一个近乎乌托邦的世界。

            > 没有考试、升学、就业任何的事情，大家一起看漫画、轻小说或是做其他什么有趣的事情，互相有很深厚的友情却给对方留有充足的空间。时而一起玩一些很有意思却不蠢的事情。飘满红茶香气，温暖悠闲却不会耽误正事，做错就道歉，无比珍视对方

            这是多么好的世界啊。

            天生拥有特异功能与众不同、拯救世界受万人敬仰、出任CEO赢取白富美走上人生巅峰什么的，其实花生对这些没有一丝丝的兴趣。

            只要，能静静的享受GJ部的日常，就已经足够了。

            只是，在这之前必须先要完成一件事。

            ---

            这就是花生所谓的GJ部，一部普通的日常番，却寄托了些什么。
        </block-collapsible>
        <block-collapsible title="写日记" lang="md" :folded="true">
            无助、迷茫。没有人支持，没有人理解，没有任何人的肯定，甚至连个说话的人都没有。

            想不通，感觉自己就要坏掉了。

            那么，写日记将是花生最后的手段。
        </block-collapsible>
        <block-justify     title="番剧" :class="$options.name+'--animation'">
            <block-justify-row lang="md" title="">
                花生看过觉得很有感悟的番，以及写的与番相关的博客文章，均整理于此

                > 排名**分**先后
            </block-justify-row>
            <block-justify-row lang="md" title="我的青春恋爱物语果然有问题">
                尽管动画化的很糟糕，但依旧无法遮挡原作的光辉。

                春物是花生看过理论最多、最完整的作品。几乎可以说，其中随便的一个理论拿出来，都可以单独作为一部艺术作品的核心。

                不仅理论量大到难以估计，也同时塑造了一个完整的世界设定。因此花生经常使用春物中的世界设定去解释自己的理论。

                理论太多，光是整理摘抄就差不多数万字，更不用说理论延伸和“利用世界设定解释自己理论”的情况了：

                相关阅读：

                - 理论整理：[读《我的青春恋爱物语果然有问题》](http://blog.pea3nut.com/e477)
            </block-justify-row>
            <block-justify-row lang="md" title="Angel Beats">
                这部番给花生的共鸣感是最强烈的，没有之一。

                绝望，孤独，痛恨这个世界，奋起反抗，付之东流的努力，幸福，不接受这这一切。。。

                我想我没法用语言来表达。

                > “非常幸福呢”
                > “如此幸福的景色”
                > “对我来说太过耀眼了”
                > ——《Angel Beats!》 第12话 12:00 仲村由理

                &nbsp;

                > “人生对我来说是仅有一次的”
                > “是在这里的...独一无二的”
                > “这就是我的人生”
                > “是不能托付给别人 也不能被夺走的人生”
                > “不能推脱 不能忘记 不能消除 不能践踏 不能一笑而过 也不能美化 什么都不能”
                > “只能去接受者真实而残酷 但仅有一次的人生”
                > “所以我要去战斗 不断的战斗”
                > “因为”
                > “这样的人生”
                > “……”
                > “我一辈子都不能接受！！”
                > ——《Angel Beats!》 第12话 12:50 仲村由理


            </block-justify-row>
            <block-justify-row lang="md" title="幼女战记">
                一个精英上班族，尽着自己的职责。如此优秀的他，成为社长也是理所当然的事情。

                本该如此的。

                只是做了理所当然的事情。

                被传送到了一个完全陌生的世界。没有亲人、没有友情、没有爱情，什么都没有，就连自己的过去都没有了。有的只有一个强大的敌人，存在X。
            </block-justify-row>
            <block-justify-row lang="md" title="吹响！上低音号">
                > “我不想勉强自己 和不感兴趣的人打好关系”
                > “因为和别人一致而感到安心 荒唐至极”
                > “我想抵抗理所当然地出现在那里的人流”
                > “虽然无法完全抵抗”
                > “不想变得和其他人一样”
                > “所以我才吹起了小号 为了成为特别的人”

                &nbsp;

                > “吹了小号就能成为特别的人吗”

                &nbsp;

                > “可以 更拼命的联系 吹的更好 就能变得更特别”
                > “我和那些只认为自己特别的人不同”
                > “要成为真正特别的人”
                > —— 番剧《吹响！上低音号》 19:40 高坂丽奈

                相关阅读：

                - [丽奈：我想成为特别的人 | 写于北京实习3周之际](http://blog.pea3nut.com/e872)
            </block-justify-row>
            <block-justify-row lang="md" title="花丸幼稚园">
                绝不仅仅是一部吸引幼女控的快餐空气系作品，作者借助幼女而表达的“真实纯粹”的爱慕 —— 一份“真真正正希望对方得到幸福”的情感。

                > 如果放弃了，就彻底结束了
                > —— 番剧《花丸幼稚园》 第8话 20:08 小杏

                番中的小杏真的是戳中了花生。世界上真的存在如此纯粹的感情吗？

                相关阅读：

                - [一旦放弃了，就彻底结束了](http://blog.pea3nut.com/e424)
            </block-justify-row>
            <block-justify-row lang="md" title="中二病也要谈恋爱">
                当补第一季仅看到12话时，花生就不再继续看了，因为不想再去毁坏心中的一部神作，此时此刻，已经足够了。

                > “你想回到无聊的现实里吗？”
                > “还是想要与我一同改变现实？！”
                > —— 番剧《中二病也要谈恋爱》第12话 16:55

                相关阅读：

                - [当一个中二的人不再中二，那么就再也回不去了…](http://blog.pea3nut.com/e511)
                - [打破现实的办法，就是不要输给现实](http://blog.pea3nut.com/e556)
                - [城堡理论](http://blog.pea3nut.com/e577)
            </block-justify-row>
            <block-justify-row lang="md" title="魔法少女小圆">
                每一次失败都可以重来，但是每次重来的代价是事情将会变的更糟。

                而放弃，则意味着永远的终结。

                > 已经，没有什么好怕的了

                相关阅读：

                - [《魔法少女小圆》番剧补后感想](http://blog.pea3nut.com/e449)
            </block-justify-row>
            <block-justify-row lang="md" title="GJ部">
                一部非常非常日常的日常番，日常到很多人都没有办法完整看完。

                可是，日常番不就应该是这样的吗？

                就像某部日常作品中说的那样：

                > 我们所经历的每一个平凡的日常，也许就是连续发生的奇迹

                不想去拯救世界，也不想拥有特异功能，只要能享受下GJ部的日常，就已经足够了。

                被KEY社虐到泪流满面，被芳文社萌到魂不守舍，各种“白学”、“春学”，还有最残酷的“现实”需要面对。

                只想安静的看一部普通的日常番休息下，再去继续下去。 只想静静的享受一下在现实中享受不到的“日常”：受欢迎、没有升学和就业、不是独自一人、不用探索未知的世界，永远...的呆在社团活动室里。

                相关阅读：

                - [GJ部的影评](http://blog.pea3nut.com/e696)
                - [学生生涯，结束了吗？GJ部的日常，永远不会上演](http://blog.pea3nut.com/e771)
            </block-justify-row>
            <block-justify-row lang="md" title="星之梦">
                > “你只要继续下去就可以了”
                > ——番剧《星之梦》 第3话

                &nbsp;

                > “早在喝酒之前，我就已经醉了”
                > ——番剧《星之梦》 第4话

                &nbsp;

                > “但其实不是这样”
                > “并不是我...出故障了”
                > “真正故障的是...”
                > “为什么...会发生故障呢”
                > ——番剧《星之梦》 第5话

                终于，相信自己眼中看到的、心中分析得出的结论。
            </block-justify-row>
            <block-justify-row lang="md" title="Rewrite">
                > “拿生命换取力量 一去不可复返”
                > ——番剧《Rewrite 2nd Season》 第24话
            </block-justify-row>
            <block-justify-row lang="md" title="KEY社相关">
                > “只要祈祷 愿望就一定会实现什么的是不可能的”
                > “然而，只要拼命去思考，尽力拼到最后一刻”
                > “结局 或许就不会那么糟糕”
                > ——番剧《CLANNAD》 第15话 18:36

                是的，所以花生还活着。

                > “人没有回忆是无法活下去的”
                > “但是 只有回忆却也是无法活下去的”
                > “因为梦终有一天会醒”
                > “醒不过来的梦 终有一天会变成悲哀”

                &nbsp;

                > “就算从梦中醒来 回忆也会留着的”
                > ——番剧《AIR》
            </block-justify-row>
        </block-justify>
        <block-collapsible title="后记" lang="md">
            你已经读完了这个页面。

            若你现在的感觉不是“神经病吧这个人”、“不明觉厉”，而是具有强烈的共鸣感。那么，你可以给花生发一封邮件。在邮件中，简要的（重新）介绍自己，并附上你对于如下问题**任选其一**的回答：

            - 你对于死亡的态度是如何的？是恐惧、回避、接受，还是说对你来说是一种诱惑？
            - 除亲情和爱情外，是否有什么东西占据着你生命的一部分？
            - 你如何看待变性、同性恋这些道德敏感问题？若这些情况发生在你的至亲、（未来）子女，甚至是你自己身上，你会如何反应？

            花生会仔细看完邮件中的每一个字，并100%给出与当前页面风格相同的回信。
        </block-collapsible>
    </div>
</template>

<script>
export default{
    extends :require('@/components/abstract/page.vue'),
    name :'page-acg',
    computed:{
        cardInfo(){
            return [{
                label:'角色名',
                text:'花生·PeA',
            },{
                label:'性别',
                text:'<i class="fa fa-mars" style="color:#5b75ff;font-weight: bold;"></i>',
            },{
                label:'年龄',
                text:this.getPeA3nutAge(),
            },{
                label:'生日',
                text:'1995-5-18',
            },{
                label:'血型',
                text:'AB',
            },{
                label:'身高/体重',
                text:'170cm/60kg',
            },{
                label:'属性',
                text:'独行者、傲娇',
            },{
                label:'能力',
                text:'能够使用负面情绪作为能量',
            },{
                label:'所属组织',
                text:'GJ部、侍奉社',
            },{
                label:'二禁症程度',
                text:'较为严重',
            },{
                label:'腾讯标识ID',
                text:'626954412',
            }]
        },
    },
    data(){return{
    }},
};
</script>

<style lang="scss">
.page-acg{
    .page-acg--animation .block-justify-row--label{
        width:7.1em !important;
        @media only screen and (max-width: 768px) {
            width:3.1em !important;
        }
    }
}
</style>

<style scoped="scoped" lang="scss">
.page-acg{
}
</style>
