<template>
    <div>
        <block-collapsible title="高能预警" lang="md">
            <i class="fa fa-exclamation-triangle" aria-hidden="true" style="color:#f00"></i> 注意！！

            此页面 ***不是*** 介绍“花生的二次元爱好”，而是：

            > 站在更低层的维度，剖析三次元的花生

            接下来的内容可能会给你带来不适！！

            若你不想过多的了解花生，请**不要**阅读此页面。返回[三次元标签页](/normal)
        </block-collapsible>
        <block-decal img-src="/static/img/follow.jpg">
            你确定要看花朵下面的根须吗？
        </block-decal>
        <article-header title="花生Peadarの的角色设定" :description="getRandomItem(Fragment.concat(FragmentAcg))" />
        <profile-card :information="cardInfo">
            <radar-img
                :radar-value="AcgRadarInfo"
                radar-color="#D7CBAC,#D6B569"
                number-color="#432B08"
                border-color="#D6B569"
            ></radar-img>
        </profile-card>
        <block-collapsible title="经历" lang="md">
            1. 因为实在是太讨厌上学了，在初中辍了学，在某鞋厂做了几个月流水线工人
            1. 本着“在玩三年”的态度去了高中，学习成绩班里倒数第二
            1. 终于决定为实现梦想，鼓起勇气努力一把。在大学创建社团和公司。受尽嘲讽，最后也果然失败了

            然后是现在。我背起背包，只身一人来到北京，花了一年的时间兑现了我曾经扬言“月薪20k”的大话

            “月薪20k”，其实一开始只是我的一句玩笑，只是后来质疑嘲讽的声音太多了，真的是太多了。我好生气，于是它成为了我的信标
        </block-collapsible>
        <block-decal img-src="/static/img/trumpet-speech-2.png">
            <h2>高音号宣言</h2>
            我不想勉强自己 和不感兴趣的人打好关系<br />
            因为和别人一致而感到安心 荒唐至极<br />
            我想抵抗理所当然地出现在那里的人流<br />
            虽然无法完全抵抗<br />
            我和那些只认为自己特别的人不同<br />
            要成为真正特别的人<br />
        </block-decal>


        <block-collapsible title="时间是敌人" lang="md" folded>
            人类是线性生物

            心爱的狗狗死了，只会伤心一段时间。不久之后，又可以因为其他的事情而开怀大笑。而多年之后，也可以波澜不惊的提起此事

            时间可以冲淡一切，伤口也会愈合

            为什么此刻认为重要的事情慢慢变得不重要了，为什么曾经想得到的事物慢慢变得没那么渴望了。为什么自己在黑夜中终于找寻到的自己，立下的决心，天亮后又不见了

            但是这很奇怪啊难道不是吗？重要的事情因为时间而变得不再重要了！!

            我觉得不可理喻，无法接受，耻辱万分

            我看过这样的一个故事：

            > 少女A有一个亲妹妹，特别要好的妹妹——相互信任、相互依赖、相互照顾、相互体谅。简直是理想中的姐妹关系
            >
            > 很不幸的是，一场交通事故带走了她的妹妹
            >
            > 少女A悲痛欲绝。一幕幕的与妹妹朝夕相处的过往经历从少女A脑内放映——如果没有妹妹，未来会是怎样的呢？少女A完全无法想象没有妹妹的世界是怎样的
            >
            > 尽管少女A非常痛苦，每天以泪洗面，但生活总归要进行下去
            >
            > 随着时间的推移，少女A惊讶的发现自己没有那么伤心了。依旧可以在没有妹妹的情况下开怀大笑，依旧可以在没有妹妹的房间里倒头就睡
            >
            > 少女A觉得自己重要的妹妹正在一步步的向自己远去
            >
            > 于是，少女A拿着她妹妹生前使用的一条发带做了一个眼罩，遮住了自己的一边眼睛。少女A说：
            >
            > > “每当我因为遮住一只眼睛而感到不便时，我就能感受到。。。”
            > > “我的妹妹就在我的身边”

            我要扭转这个人类的本能，不因为其与生俱来而不去改变

            绝不能的让“眼前的东西”和“更容易获得的东西”，去代替了“更重要的东西”

            所以我写文章，给它们起一些好记的名字，订立属于自己的每年的“节日”，来不停的提醒自己不要忘记，不要忘记曾经的自己，不要忘记曾经渴望的事物，不要忘记曾经刻苦铭心的经历

            时间是敌人
        </block-collapsible>
        <block-collapsible title="不因世界而改变" lang="md" folded>
            > 通常牢骚发完之后，对方就会回以“辛苦的又不止你一个”这样的套话。为什么大家辛苦我就非得辛苦不可啊？这有什么逻辑关系吗？
            > —— 《我的青春恋爱喜剧果然有问题》第七册 P217

            “不因世界而改变”是花生身上最核心的特点，几乎所有的观念都派生于此。包括最具特点的[时间是敌人](#时间是敌人)

            不因无力改变而接受现在，也不因“其他人都是这样”而接受现状。过分是事情就是过分的事情，不因任何原因，来坦然接受过分的事情

            因此，你能看到@@[在北京地铁上花生反抗的身影](#! md
                在我刚刚来北京工作时，每天需要乘坐地铁上下班。地铁很挤，挤到连想抬起一只胳膊都需要花很大的力气。路线很长，每天要在地铁花掉2个小时。2个小时，一天清醒时间的 12.5%。

                说实话我不知道其他人是如何心安理得的在地铁上看剧和玩游戏的——在如此的环境，被如此的对待，用如此的时间。

                我才不管其他人玩的有多么开心，我只知道，我不接受。

                于是我开始了挣扎。

                我尝试利用这每天清醒时间的12.5%。我开始买书拿到地铁上看，书体积太大不方便阅读，那就撕成页来读。灯光太昏暗看不清书上的小字，那就在休息日制作一些在地铁上也能看清的英语单词卡来背……

                尽管依旧像被对待垃圾一样对待——2个小时的摇摇晃晃被挤来挤去，但是我在挣扎。

                奋力挣扎，企图在北京地铁上夺回一些尊严
            )@@。你能听到在月光下花生的《高音号宣言》：

            > 我不想勉强自己和不感兴趣的人打好关系
            > 因为与其他人一致而感到安心，荒唐至极
            > 我想抵抗理所当然出现在那里的人流
            > 虽然无法完全抵抗
            > 我和那些只认为自己特别的人不同
            > 要成为，真正特别的人

            我常常会在下班的归途中大声宣誓，向自己宣誓，向整个世界宣誓

            为什么随着时间的流逝就会让我认为重要的东西变得不重要？为什么其他员工都没半年升过职所以我也就不能半年升？为什么大家是这样，整个世界是这样，我也必须要这样？

            我绝不接受
        </block-collapsible>
        <block-collapsible title="花生的节日" lang="md" folded>
            节日是为了对抗时间而设立的一年一度的“特殊的一天”，来提醒自己不要忘记某些重要时刻——我是这样的理解的

            于是，花生有一些属于自己的重要时刻，属于自己的“节日”：

            - 3月9日：感谢日 & 椎名p 生日 & 诞生之日。被赋予“一切的开始”含义的最重要的节日
            - 12月27日：鏡音リン・レン诞生日。最喜欢的V家角色在这一天诞生
            - 7月23日：@@[椎名p](#! md 一个我非常喜欢的V家p主，永远留在了2015年7月23日。详见[关于椎名もた的自杀，我一直无法释](http://pea3nut.blog/e46))@@祭日
            - 7月20日：@@[查斯特·贝宁顿](乐队 LinkinPark 的主唱)@@ 祭日

            于此同时，大部分的公立节日我都是不过的。我不是基督教徒，因此不会过圣诞节。我没那么喜欢月亮，因此不会过农历新年 。其他人过不过这些节日对我来说不重要，重要的是，这些公立节日远没有我自己的节日重要

            我要对抗时间，牢记属于我的重要时刻
        </block-collapsible>
        <block-collapsible title="独行" lang="md" folded>
            花生是一个独行者

            独行者，并不是说与其他人格格不入，无法团队协作的。独行者是指大部分时间都是自己呆着，大部分事情都能自己完成，并且也非常喜欢这种独来独往感觉的人

            独行者当然可以与其他人团队协作来完成作业，也可以与其他团队成员融洽相处。只是独行大部分情况下更有效率，且某些事情只能独行时做

            1. 独行可以带来更多的思考时间。当身边没有人说话时，没什么其他事情做就会自然而然陷入思考。思考自己之前做的怎么样，思考接下来应该做什么，思考人类为什么有10个手指，思考自行车轮子是如何造出来的。积累起来的思考，是有力量的
            1. 如果希望静静的思考一些复杂问题，那么独行几乎是唯一的选择
            1. 如果只注重结果而不考虑过程是否快乐，大部分事情单独行动是最好的选择

            我曾在大学时期，在教学楼的天台上打过这样的一个简易庇护所来与自己独处 ↓

            ![](/static/img/in-school-ceiling.jpg)

            我在上边读书、查资料、看动漫，渡过了一整个湛蓝的夏天

            当然独行也有缺点，频繁的独行会带来戒断反应——人是群居动物，频繁的独行会导致产生群居戒断反应——会非常想有人结伴同行。这个我将它归类为[天谴](http://pea3nut.blog/e533)的一种。目前已经逐渐习惯了
        </block-collapsible>
        <block-collapsible title="黑色的小精灵" lang="md" folded>
            我喜欢黑夜，一度认为自己是“黑夜世界的居民”

            在黑夜中与自己独处。在黑夜中思考，在黑夜中挣扎，在黑夜中流泪，在黑夜中愉悦，与黑夜融于一体

            @|有时我甚至会躲在黑夜中的角落里，静静的注视着路过的那些成群结队欢声笑语的“明亮世界的居民”们。还好至今都没有人发现我，要不然可能会给对方留下不好的阴影（笑）@|

            之前看到有人写过，“黑夜中会不会有一群黑色的小精灵在跳一支黑色的舞”，我一方面惊叹于其憧憬的美好与文笔，也逐渐意识到，我可能就是文中那只黑色的小精灵。我会在黑暗中住下，呆很长的时间

            当有人追随黑暗来到一个偏僻的角落，推开一扇空教室的门，或是顺着楼梯爬上天台，那么就有可能发现在黑夜中“翩翩起舞”的我

            ![](/static/img/in-school-ceiling-night.png)
        </block-collapsible>
        <block-collapsible title="不谙世事与冷血" lang="md" folded>
            由于大部分时间都独来独往，加上社交少，不谙世事也是难免的事情

            > 关于不谙世事详细的解释清参考[三次元：不谙世事](/normal#不谙世事)

            但是与此同时，你也许会同时看到一个稍稍“冷血”的花生

            但是事实完全不是这样的

            一方面，由于过于不谙世事导致花生对于人情世故的处理，因缺乏经验而稍显笨拙。另一方面，由于过多的思考，你能看到一个处处犹豫的花生

            尤其是每当有人向花生需求帮助时，总能看到花生“犹豫”了很久后，才答应下来。而这个“犹豫”常常会被理解为“不情愿”，但是实际上完全不是这样的。只是因为想尽可能考虑周全后再做决定，花生做任何决定都是会很犹豫

            经过犹豫的帮助依旧是帮助，经过犹豫的勇敢也依旧是勇敢

            与老好人和勇夫的那种“不考虑太多，大步向前”的风格不同。我会考虑再三，我会害怕，我会感到麻烦，我会想到逃跑。但是我不会逃跑，我会贯彻到底我认为正确的事
        </block-collapsible>
        <block-collapsible title="疼与动力" lang="md" folded>
            花生不讨厌疼痛。不论是心理上的，还是物理上的

            或者说，花生是拥抱疼痛，转而化为动力的那种人。痛苦、不甘、压力，对于花生而言反而是正面 Buff

            我当然也希望自己的动力来源是爱与信任，可惜这些是我不曾拥有的。因此我只能使用痛苦、不甘、压力作为前进动力，这是一种别无选择的选择。只是后来我发现这东西效果还不错

            久而久之，我不再已经讨厌它们了
        </block-collapsible>
        <block-collapsible title="GJ部" lang="md">
            当我实现梦想后，我希望能够过上GJ部的那种日常当中

            没有超能力，没有必须要做的事。不需要拯救世界，也不需要被拯救

            每天喝喝茶，聊聊天，看看漫画，打发时间。我好喜欢这种无所事事打法时间的感觉
        </block-collapsible>

        <block-decal lang="md">
            你已经相当了解花生了

            但花生可能还不了解你。给花生写一封邮件怎么样？告诉花生你看完的感想，告诉花生关于你自己的事情

            发送邮件后，你与花生就已经是“笔友”之间的关系啦——我愿意与看完本页内容，发送邮件的你建立“笔友”关系。你会收到花生的回信，你会定期收到花生的“季节邮件”。如果你愿意，你也可以看一看三次元的花生是怎样的

            @|pea3nut#qq.com|@
        </block-decal>
    </div>
</template>

<script>
export default{
    extends :require('@/components/abstract/page.vue'),
    name :'page-acg',
    computed:{
        cardInfo(){
            return [{
                label:'角色名',
                text:'花生Peadar',
            },{
                label:'现居地',
                text:this.Info['present_address'],
            },{
                label:'社会身份',
                text: '程序员',
            },{
                label:'属性',
                text:'混乱善良、独行者、微笑抑郁',
            },{
                label:'所属组织',
                text:'SSS团、GJ部',
            },{
                label:'QQ',
                text:'626954412',
            },{
                label:'邮箱',
                text:'pea3nut#qq.com',
            }]
        },
    },
    data(){return{
    }},
};
</script>

<style lang="scss">
.page-acg{
    .page-acg--animation .block-justify-row--label{
        width:7.1em !important;
        @media only screen and (max-width: 768px) {
            width:3.1em !important;
        }
    }
}
</style>

<style scoped="scoped" lang="scss">
.page-acg{
}
</style>
