<template>
    <div>
        <article-header title="花生PeAの的角色设定" :description="getRandomItem(Fragment.concat(FragmentAcg))" />
        <profile-card :information="cardInfo">
            <radar-img
                :radar-value="AcgRadarInfo"
                radar-color="#D7CBAC,#D6B569"
                number-color="#432B08"
                border-color="#D6B569"
            ></radar-img>
        </profile-card>
        <block-collapsible title="高能预警" lang="md">
            <i class="fa fa-exclamation-triangle" aria-hidden="true" style="color:#f00"></i> 注意！！

            此页面 ***不是*** 介绍"花生的二次元爱好"，而是：

            > 站在更底层的角度，剖析三次元的花生

            接下来的内容可能会给你带来不适！若你不想过多的了解花生，请**不要**阅读此页面。它可能会颠覆你对花生的认知！！

            若你执意阅读，接下来，将会为你，展示...
        </block-collapsible>
        <block-decal lang="md" img-src="/static/img/kokoro-step.png">
            “我不相信真理，我只相信逻辑，相信自己”
        </block-decal>
        <block-collapsible title="说明" lang="md">
            接下来的模块大部分将是默认折叠的，你可以点击标题将他们展开。同时，其中的每一个模块都可以<router-link to="/about#站点额外功能">被URL索引</router-link>。
        </block-collapsible>
        <block-collapsible title="花生PeA的构造" lang="md" :folded="true">
            花生PeA具有严谨的行事逻辑来组成“自我迭代”功能，其中的结构如下：

            - 花生PeA（pea3nut）
                - 花生（PeA_nut）
                    - 实现（nut）
                    - 方针（PeA）
                    - 梦想（Neap）
                    - @-信仰（3）-@（已被移除）
                - 自我意识

            [《花生的社交指导方针》](http://blog.pea3nut.com/e1098)是一个非常好的例子可以说明这个结构的运作：

            > 首先是 *自我意识* 发现自己在学校的作风在放在职场不合适。
            > 为什么不合适呢，因为原有的作风对 *梦想（Neap）* 不利
            > 所以接下来要修改 *方针（PeA）*。由原本的“避免社交”变为“拥抱社交”。
            > *方针（PeA）* 的修改会影响更上层的 *实现（nut）*，如原来的“为了避免无用社交，所以干脆避免所有社交”不再适用，更好的一个办法是“为了不错过有效社交，尽可能参与所有社交”。

            上边的结构和行动流可以看到明显的一些特点：

            - 底层驱动上层，上层为底层服务
            - 底层的变动会导致上层轰塌，所以越底层越稳定，越上层则变动越频繁

            而整个自我迭代的过程，其实是：由 *自我意识* 不断寻找对 *梦想（Neap）* 更优的 *方针（PeA）* 然后修改 *实现（nut）* 的过程。

            ---

            与此同时，也有相当一部分 *方针（PeA）* 不参与“自我迭代”，属于不可迭代的。而本页面，则主要介绍这些不可迭代的 *方针（PeA）* 都有哪些，以及它们为什么成为了不可迭代的。

            而花生PeA真正的颜色，就是由这些 *梦想（Neap）* 和 *不可迭代的方针（PeA）* 组成的。
        </block-collapsible>
        <block-collapsible title="不因世界而改变" lang="md" :folded="true">
            > 通常牢骚发完之后，对方就会回以“辛苦的又不止你一个”这样的套话。为什么大家辛苦我就非得辛苦不可啊？这有什么逻辑关系吗？
            > —— 《我的青春恋爱喜剧果然有问题》第七册 P217

            在我刚刚来北京工作时，每天需要乘坐地铁上下班。地铁很挤，挤到连想抬起一只胳膊都需要花很大的力气。路线很长，每天要在地铁花掉2个小时。2个小时，一天清醒时间的 12.5%。

            说实话我不知道其他人是如何心安理得的在地铁上看剧和玩游戏的——在如此的环境，被如此的对待，用如此的时间。

            我才不管其他人玩的有多么开心。我只知道，我不接受。

            于是我开始了挣扎。

            我尝试利用这每天清醒时间的12.5%。我开始买书拿到地铁上看，书体积太大不方便阅读，那就撕成页来读。灯光太昏暗看不清书上的小字，那就在休息日制作一些在地铁上也能看清的单词卡……

            尽管依旧像被对待垃圾一样对待——2个小时的摇摇晃晃，被挤来挤去。但是我在挣扎，奋力挣扎，企图在北京地铁上夺回一些的尊严。

            在一个个寒冷的夜晚，月光下，有我宣誓的身影：

            > 我不想勉强自己和不感兴趣的人打好关系
            > 因为与其他人一致而感到安心，荒唐至极
            > 我想抵抗理所当然出现在那里的人流
            > 虽然无法完全抵抗
            > 我可那些只认为自己特别的人不同
            > 要成为，真正特别的人

            会常常会在下班的归途中大声宣誓，向自己宣誓，向整个世界宣誓。

            ---

            - [丽奈：我想成为特别的人 | 写于北京实习3周之际](http://blog.pea3nut.com/e872)
        </block-collapsible>
        <block-collapsible title="时间是敌人" lang="md" :folded="true">
            人类是一种线性生物。

            心爱的狗狗死了，只会伤心一段时间。不久之后，又可以因为其他的事情而开怀大笑。而多年之后，也可以波澜不惊的提起此事。

            时间可以冲淡一切，伤口也会愈合。

            > 过去的就让他过去吧

            这是大人们常说的一句话。但是这很奇怪啊难道不是吗？重要的事情因为时间而变得不再重要了！

            我觉得不可理喻，无法接受，耻辱万分。我要扭转这个人类的本能。

            记得我看过这样的一个故事：

            > 少女A有一个妹妹，特别要好的妹妹——相互信任、相互依赖、相互照顾、相互体谅。简直是理想中的姐妹关系。
            >
            > 很不幸的是，一场交通事故带走了她的妹妹。
            >
            > 少女A悲痛欲绝，一幕幕的过往经历从少女A脑内放映——如果没有妹妹，未来会是怎样的呢？
            >
            > 经过少女A非常痛苦，每天以泪洗面。但是生活总归要进行下去。
            >
            > 随着时间的推移，少女A惊讶的发现自己没有那么伤心了。依旧可以在没有妹妹的情况下开怀大笑，依旧可以在没有妹妹的房间里倒头就睡。
            >
            > 少女A觉得自己重要的妹妹在一步步的向自己离去。
            >
            > 于是，少女A拿着她妹妹生前使用的一条发带做了一个眼罩，遮住了自己的一只眼睛。
            >
            > > “每当我因为遮住一只眼睛而感到不方便时，我就能感受的到，我的妹妹就在我身边”

            花生在看到这个故事时，产生了极大的共鸣——因为花生也是这么做的。 大家熟知的“卧薪尝胆”中的越王勾践，也是这么做的。

            可惜，大部分人没有这么做，轻易的让“眼前的东西”和“更容易获得的东西”，代替了“更重要的东西”。于是，一个个“梦想”变成了“曾经的梦想”，变成了“期望的生活状态”。

            我要改变这个行为，不因为与生俱来而不去改变，不因为大家接受选择接受。
        </block-collapsible>
        <block-collapsible title="花生的节日" lang="md" :folded="true">
            所谓节日，就是为了那些重要的时刻而设立的吧，提醒自己不要忘记。那么，这些是花生的节日：

            - 3.9：感谢祭 & 椎名P生日，被赋予“一切的开始”含义
            - 7.23：[椎名p](http://blog.pea3nut.com/e46) 祭日
            - 7.20：查斯特·贝宁顿 祭日
            - 8.31：初音ミク 生日
            - 12.27：鏡音リン・レン 生日

            花生**只**过自己的节日。
        </block-collapsible>
        <block-collapsible title="V家，VOCALOID" lang="md" :folded="true">
            花生的5个节日，其中4个与VOCALOID有关。

            花生的头像，出自VOCALOID的PV《ココロ・キセキ》。这个大概一生都不会换掉了。

            ---

            说实话，现在想描述“VOCALOID对我而言到底意味着什么”已经有些晚了

            如果询问一个正常人“拥有双手是一种什么样的体验”，那么他会如何回答呢？或许在他刚刚获得双手时他会有许多的感慨，有许多心情可以表达，但是当他慢慢适应，当双手真的融入他的身体中时，他已经很难再回答“拥有双手是一种什么样的体验”了。

            那么VOCALOID对我来说也是一样的，我唯一能够感受到的是——它已经完全融入到了我的生命中了。

            不过简单的说说历程还是可以办到的。

            在遇见VOCALOID之前，我一直过着浑浑噩噩的生活：初中辍学到流水线工厂工作，本着可以多玩3年的态度上高中，班级的倒数前五总能看见的我名字，每日玩游戏时间在7小时以上……我不清楚那算不算活着，也不清楚这段时间我是如何度过的。我对那段时间没有任何无实感，就像在出生开始记事前一样。

            不过，我一切的印象一切的记忆，它们是从哪里开始的，我还是记得的。

            各种机缘巧合下，我听到了2首改变我人生轨迹的曲子。

            第一首曲子是[《恶系列三部曲》](http://pan.baidu.com/s/1hrxeWss)，这首曲子粉碎了一直以来的我。从这首曲子为起点，我真正意识到我错了。

            第二首曲子是[《ココロ・キセキ》](http://pan.baidu.com/s/1hqQAU80)，如果说《恶系列三部曲》是“杀死”的话，那么《ココロ・キセキ》就是“新生”。从这首曲子为起点，我开始有了目标，有了方针，有了行动。

            然后接下来也遇到了很多优秀的VOCALOID曲子，它们和我渡过了一次又一次的难关，不断向前，不断进化。然后就有了现在的我。

            一名初中辍学的流水线工作，最终拿到了百度 Special Offer。这样的故事你会相信吗？

            我想，如果你能够看到深夜中亮着最后一排灯的教室，能够听到每天14个小时的键盘敲击的声音的话，你会相信的。

            ---

            - [那些对花生而言意义重要的歌曲](http://blog.pea3nut.com/e243)
            - [关于椎名もた的自杀，我一直无法释怀](http://blog.pea3nut.com/e46)
        </block-collapsible>
        <block-collapsible title="燃料，负面情绪" lang="md" :folded="true">
            > 事后带着惨痛的回忆，懊恼地告诫自己不要再犯第二次错误，这才是所谓的成长吧。
            > —— 《我的青春恋爱喜剧果然有问题》第六册 P56

            ---

            正面情绪与负面情绪，总有一样会被选为“继续下去”的理由。花生是后者，或许是因为负面情绪更加激烈更加容易获得，也或许是因为完全没有什么正面情绪可以用（笑）。

            所以，花生崇尚疼痛。

            越是疼痛，则越是清醒，越是理性。所以花生会铭记受到的每一份疼痛，细细品味它，以便发挥出它的全部威力。为了梦想，我可以不讨厌疼痛，并主动的去承受它们。

            在疼痛中翩翩起舞，听起来有些像抖M？不过这是为了梦想，一切都是值得的。

            ---

            - [春物：“雪之下阳乃式成长”与“平冢静式成长”](http://blog.pea3nut.com/e747)
            - [弱点论：一个归宿、一个慰藉、一个弱点](http://blog.pea3nut.com/e854)
        </block-collapsible>
        <block-collapsible title="永远的GJ部" lang="md" :folded="true">
            花生看了一部非常普通的日常番。特别平淡，没有任何主线，什么都没有。

            但是每当回忆起，却让花生湿润了眼眶。

            这可以说是花生梦寐以求的生活——没有主线，无聊的打发时间。没有超能力，整日在社团活动室中喝茶聊天。世界不需要我拯救，我也不需要世界来拯救。

            可惜，我们都清楚，这种平淡的日常，永远，不会上演在花生PeA身上——因为花生有梦想。

            “等梦想实现后，就过这样的生活吧”，花生如是想到。

            ---

            这就是花生所谓的GJ部，一部普通的日常番，却寄托了些什么。

            - [学生生涯，结束了吗？GJ部的日常，永远不会上演](http://blog.pea3nut.com/e771op)
            - [GJ部的影评](http://blog.pea3nut.com/e696)
        </block-collapsible>
        <block-collapsible title="完整的花生" lang="md" :folded="true">
            花生是完整的。

            可以不被别人需要，也不需要别人的情况下活下去。社交不是刚需，负面情绪可以使用，而分享也可以抑制。

            对于花生来说，单独行动才是默认行为。当我说出”吃火锅“、”去喝咖啡/鸡尾酒“、”出去骑自行车“、”听音乐会“时，除非额外附着了”和xx“之类的修饰，否则都是自己一个人去的。因为平常交谈频繁的说”我上周末自己一个人去xxx了“显得有些卖可怜，而明明我又玩的很开心啊！所以干脆就改掉措词习惯——只有在多人行动的时候才加修饰，单独行动的时候不加。

            与完整与之相对的是残缺，尽管残缺听起来像是一个贬义词，但是实际上二者各有各的好处。

            残缺可以更容易与他人建立依附或被依附关系，这是一种无出其右的社交手段！而完整则几乎失去了这项能力，但由于对于依附和被依附不是刚需，因此会更加自由一些。

            就幸福感来说，残缺的曲线波动要远大于完整。完整的幸福感通常来说十分平稳，而残缺的幸福感很大程度取决于依附和被依附的对方。
        </block-collapsible>

        <block-justify     title="番剧" :class="$options.name+'--animation'">
            <block-justify-row lang="md" title="">
                花生看过觉得很有感悟的番，以及写的与番相关的博客文章，均整理于此。

                花生的完整番剧排名及补番列表，可以[在这里](https://gist.github.com/pea3nut/461c9dd9a413c64cdfd908a5d837aecd#file-md)查看（需科学上网）。

                > 排名**分**先后
            </block-justify-row>
            <block-justify-row lang="md" title="我的青春恋爱物语果然有问题">
                尽管动画化的很糟糕，但依旧无法遮挡原作的光辉。

                春物是花生看过理论最多、最完整的作品。其中随便的一个理论拿出来，都可以单独作为一部艺术作品的核心。

                不仅理论量大到难以估计，也同时塑造了一个完整的世界设定。因此花生经常使用春物中的世界设定去解释自己的理论。

                理论太多，光是整理摘抄就差不多数万字，更不用说理论延伸和“利用世界设定解释自己理论”的情况了。

                ---

                - 理论整理：[读《我的青春恋爱物语果然有问题》](http://blog.pea3nut.com/e477)
                - [春物：“雪之下阳乃式成长”与“平冢静式成长”](http://blog.pea3nut.com/e747)
                - [弱点论：一个归宿、一个慰藉、一个弱点](http://blog.pea3nut.com/e854)
                - [除了白学，《春物》还给我们留下了什么？](https://zhuanlan.zhihu.com/p/24432235)
            </block-justify-row>
            <block-justify-row lang="md" title="Angel Beats">
                这部番给花生的共鸣感是最强烈的，没有之一。

                绝望，孤独，痛恨这个世界，奋起反抗，付之东流的努力，幸福，不接受这这一切。。。

                我想我没法用语言来表达。

                > “非常幸福呢”
                > “如此幸福的景色”
                > “对我来说太过耀眼了”
                > ——《Angel Beats!》 第12话 12:00 仲村由理

                &nbsp;

                > “人生对我来说是仅有一次的”
                > “是在这里的...独一无二的”
                > “这就是我的人生”
                > “是不能托付给别人 也不能被夺走的人生”
                > “不能推脱 不能忘记 不能消除 不能践踏 不能一笑而过 也不能美化 什么都不能”
                > “只能去接受者真实而残酷 但仅有一次的人生”
                > “所以我要去战斗 不断的战斗”
                > “因为”
                > “这样的人生”
                > “……”
                > “我一辈子都不能接受！！”
                > ——《Angel Beats!》 第12话 12:50 仲村由理


            </block-justify-row>
            <block-justify-row lang="md" title="吹响！上低音号">
                > “我不想勉强自己 和不感兴趣的人打好关系”
                > “因为和别人一致而感到安心 荒唐至极”
                > “我想抵抗理所当然地出现在那里的人流”
                > “虽然无法完全抵抗”
                > “不想变得和其他人一样”
                > “所以我才吹起了小号 为了成为特别的人”

                &nbsp;

                > “吹了小号就能成为特别的人吗”

                &nbsp;

                > “可以 更拼命的联系 吹的更好 就能变得更特别”
                > “我和那些只认为自己特别的人不同”
                > “要成为真正特别的人”
                > —— 番剧《吹响！上低音号》 19:40 高坂丽奈

                我常常在下班的夜路上大声说出上边番中的台词，当做是自己的宣誓。

                ---

                - [丽奈：我想成为特别的人 | 写于北京实习3周之际](http://blog.pea3nut.com/e872)
            </block-justify-row>
            <block-justify-row lang="md" title="比宇宙更远的地方">
                > 我要出去旅行
                > 在卫生间换好衣服
                > 坐上与学校相反方向的电车
                > 在一如往常的学校之中 只有我一个人跳脱出来
                > 展开没有目标的旅行
                > 去往那从未见过的地方
                > —— 番剧《比宇宙更远的地方》 第一话 06:17

                &nbsp;

                > “等等啊 所以说你为什么要那么固执”
                > “吵死了 固执有什么不好
                > 我就是这样活过来的
                > 固执己见 被人嘲弄 伤心难过
                > 即使如此依然固执己见
                > 因为我没有做错！”
                > —— 番剧《比宇宙更远的地方》 第六话 18:32

                &nbsp;

                > 如果你不想我顾虑你的话我就直说
                > 我不想变成被人说“不要在意”就真的不去在意的笨蛋
                > 我不想变成被人说“你们先走”就真的先走的薄情之人
                > —— 番剧《比宇宙更远的地方》 第六话 18:45
            </block-justify-row>
            <block-justify-row lang="md" title="电波女与青春男">
                > “就算你现在没台阶下
                > 只要好好道歉大家还是会原谅你的”

                &nbsp;

                > “啰嗦！！

                &nbsp;

                > 说谎话的小孩 也就是喊狼来了的小孩不被相信
                > 不管是绵羊还是山羊 最终被吃掉了
                > 这些寓言的说教怎么都无所谓
                > 重要的是 喊狼来了的孩子不断说谎
                > 导致了真的把狼招来了村子的结果
                > 相信又有什么改变 你如此说过吧
                > 相信之后会有什么发生改变
                > 就让你用你的五感去铭记吧！”
                > —— 番剧《电波女与青春男》 第十三话 17:53

                这让我想起了花生曾经的座右铭。可惜看到的有些晚。
            </block-justify-row>
            <block-justify-row lang="md" title="GJ部">
                一部非常非常日常的日常番，日常到很多人都没有办法完整看完。

                可是，日常番不就应该是这样的吗？

                就像某部日常作品中说的那样：

                > 我们所经历的每一个平凡的日常，也许就是连续发生的奇迹

                不想去拯救世界，也不想拥有特异功能，只要能享受下GJ部的日常，就已经足够了。

                被KEY社虐到泪流满面，被芳文社萌到魂不守舍，各种“白学”、“春学”，还有最残酷的“现实”需要面对。

                只想安静的看一部普通的日常番休息下，再去继续下去。 只想静静的享受一下在现实中享受不到的“日常”：受欢迎、没有升学和就业、不是独自一人、不用探索未知的世界，永远...的呆在社团活动室里。

                ---

                - [永远的GJ部](#永远的GJ部)
                - [GJ部的影评](http://blog.pea3nut.com/e696)
                - [学生生涯，结束了吗？GJ部的日常，永远不会上演](http://blog.pea3nut.com/e771)
            </block-justify-row>
            <block-justify-row lang="md" title="花丸幼稚园">
                绝不仅仅是一部吸引幼女控的快餐空气系作品，作者借助幼女而表达的“真实纯粹”的爱慕 —— 一份“真真正正希望对方得到幸福”的情感。

                > 如果放弃了，就彻底结束了
                > —— 番剧《花丸幼稚园》 第8话 20:08 小杏

                番中的小杏真的是戳中了花生。世界上真的存在如此纯粹的感情吗？

                ---

                - [一旦放弃了，就彻底结束了](http://blog.pea3nut.com/e424)
            </block-justify-row>
            <block-justify-row lang="md" title="中二病也要谈恋爱">
                当补第一季仅看到12话时，花生就不再继续看了，因为不想再去毁坏心中的一部神作，此时此刻，已经足够了。

                > “你想回到无聊的现实里吗？”
                > “还是想要与我一同改变现实？！”
                > —— 番剧《中二病也要谈恋爱》第12话 16:55

                ---

                - [当一个中二的人不再中二，那么就再也回不去了…](http://blog.pea3nut.com/e511)
                - [打破现实的办法，就是不要输给现实](http://blog.pea3nut.com/e556)
                - [城堡理论](http://blog.pea3nut.com/e577)
            </block-justify-row>
            <block-justify-row lang="md" title="魔法少女小圆">
                每一次失败都可以重来，但是每次重来的代价是事情将会变的更糟。

                而放弃，则意味着永远的终结。

                > 已经，没有什么好怕的了

                ---

                - [《魔法少女小圆》番剧补后感想](http://blog.pea3nut.com/e449)
            </block-justify-row>
            <block-justify-row lang="md" title="星之梦">
                > “你只要继续下去就可以了”
                > ——番剧《星之梦》 第3话

                &nbsp;

                > “早在喝酒之前，我就已经醉了”
                > ——番剧《星之梦》 第4话

                &nbsp;

                > “但其实不是这样”
                > “并不是我...出故障了”
                > “真正故障的是...”
                > “为什么...会发生故障呢”
                > ——番剧《星之梦》 第5话

                终于，相信自己眼中看到的、心中分析得出的结论。
            </block-justify-row>
            <block-justify-row lang="md" title="幼女战记">
                一个精英上班族，尽着自己的职责。如此优秀的他，成为社长也是理所当然的事情。

                本该如此的。

                只是做了理所当然的事情。

                被传送到了一个完全陌生的世界。没有亲人、没有友情、没有爱情，什么都没有，就连自己的过去都没有了。有的只有一个强大的敌人，存在X。
            </block-justify-row>
            <block-justify-row lang="md" title="Rewrite">
                > “拿生命换取力量 一去不可复返”
                > ——番剧《Rewrite 2nd Season》 第24话
            </block-justify-row>
            <block-justify-row lang="md" title="Happy Sugar Life">
                如果当时翔子说出了那没说出的话，会是怎样的呢。那应该就是这个故事了吧：[四季折の羽](https://www.bilibili.com/video/av2039852)。可惜她没有，所以她必须要死。

                和番中的砂糖酱一样的是，花生也不懂什么叫做爱。但是对比砂糖酱，花生更像是砂糖的叔母。
            </block-justify-row>
            <block-justify-row lang="md" title="KEY社相关">
                > “只要祈祷 愿望就一定会实现什么的是不可能的”
                > “然而，只要拼命去思考，尽力拼到最后一刻”
                > “结局 或许就不会那么糟糕”
                > ——番剧《CLANNAD》 第15话 18:36

                是的，所以花生还活着。

                > “人没有回忆是无法活下去的”
                > “但是 只有回忆却也是无法活下去的”
                > “因为梦终有一天会醒”
                > “醒不过来的梦 终有一天会变成悲哀”

                &nbsp;

                > “就算从梦中醒来 回忆也会留着的”
                > ——番剧《AIR》
            </block-justify-row>
        </block-justify>
        <block-collapsible title="后记" lang="md">
            你已经读完了这个页面。

            所以。

            为什么不给花生发一封邮件呢？`626954412#qq.com`，我保证你一定可以收到花生的回信。

            内容请多于1000字。
        </block-collapsible>
    </div>
</template>

<script>
export default{
    extends :require('@/components/abstract/page.vue'),
    name :'page-acg',
    computed:{
        cardInfo(){
            return [{
                label:'角色名',
                text:'花生·PeA',
            },{
                label:'性别',
                text:'<i class="fa fa-mars" style="color:#5b75ff;font-weight: bold;"></i>',
            },{
                label:'年龄',
                text:this.getPeA3nutAge(),
            },{
                label:'生日',
                text:'1995-5-18',
            },{
                label:'血型',
                text:'AB',
            },{
                label:'身高/体重',
                text:'170cm/60kg',
            },{
                label:'属性',
                text:'独行者、傲娇',
            },{
                label:'能力',
                text:'能够使用负面情绪作为能量',
            },{
                label:'所属组织',
                text:'GJ部、侍奉社',
            },{
                label:'Wechat',
                text:'huasheng_pea',
            },{
                label:'腾讯标识ID',
                text:'626954412',
            }]
        },
    },
    data(){return{
    }},
};
</script>

<style lang="scss">
.page-acg{
    .page-acg--animation .block-justify-row--label{
        width:7.1em !important;
        @media only screen and (max-width: 768px) {
            width:3.1em !important;
        }
    }
}
</style>

<style scoped="scoped" lang="scss">
.page-acg{
}
</style>
